Tekla Open API Reference for Tekla Structures 2025
BaseWeld.WeldTypeEnum Enumeration
 The weld types.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum WeldTypeEnum
Public Enumeration WeldTypeEnum
Members
Member name | Value | Description
WELD_TYPE_NONE | 0 |  No weld type.
WELD_TYPE_EDGE_FLANGE | 1 |  The edge-flange weld.
WELD_TYPE_SQUARE_GROOVE_SQUARE_BUTT | 2 |  The square-groove (square butt) weld.
WELD_TYPE_BEVEL_GROOVE_SINGLE_V_BUTT | 3 |  The bevel-groove (single-V butt) weld.
WELD_TYPE_BEVEL_GROOVE_SINGLE_BEVEL_BUTT | 4 |  The bevel-groove (single-bevel butt) weld.
WELD_TYPE_SINGLE_V_BUTT_WITH_BROAD_ROOT_FACE | 5 |  The single-V butt weld with broad root face.
WELD_TYPE_SINGLE_BEVEL_BUTT_WITH_BROAD_ROOT_FACE | 6 |  The single-bevel butt weld with broad root face.
WELD_TYPE_U_GROOVE_SINGLE_U_BUTT | 7 |  The U-groove (single U-butt) weld.
WELD_TYPE_J_GROOVE_J_BUTT | 8 |  The J-groove (single J-butt) weld.
WELD_TYPE_BEVEL_BACKING | 9 |  The bevel backing weld.
WELD_TYPE_FILLET | 10 |  The fillet weld.
WELD_TYPE_PLUG | 11 |  The plug weld.
WELD_TYPE_SPOT | 12 |  The spot weld.
WELD_TYPE_SEAM | 13 |  The seam weld.
WELD_TYPE_SLOT | 14 |  The slot weld.
WELD_TYPE_FLARE_BEVEL_GROOVE | 15 |  The flare-bevel-groove weld.
WELD_TYPE_FLARE_V_GROOVE | 16 |  The flare V-groove weld.
WELD_TYPE_CORNER_FLANGE | 17 |  The corner-flange weld.
WELD_TYPE_PARTIAL_PENETRATION_SINGLE_BEVEL_BUTT_PLUS_FILLET | 18 |  The partial penetration (single-bevel butt + fillet) weld.
WELD_TYPE_PARTIAL_PENETRATION_SQUARE_GROOVE_PLUS_FILLET | 19 |  The partial penetration (square groove + fillet) weld.
WELD_TYPE_MELT_THROUGH | 20 |  The melt-through weld.
STEEP_FLANKED_BEVEL_GROOVE_SINGLE_V_BUTT | 21 |  The steep flanked bevel groove single-V butt weld.
STEEP_FLANKED_BEVEL_GROOVE_SINGLE_BEVEL_BUTT | 22 |  The steep flanked bevel groove single-bevel butt weld.
WELD_TYPE_EDGE | 23 |  The edge weld.
WELD_TYPE_ISO_SURFACING | 24 |  The ISO surfacing weld.
WELD_TYPE_FOLD | 25 |  The fold weld.
WELD_TYPE_INCLINED | 26 |  The inclined weld.
See Also
Reference
Tekla.Structures.Model Namespace